tutorials/incompressibleFluid/TJunction/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    fz1;
        type    faceZoneSet;
        action  new;
        source  searchableSurfaceToFaceZone;
        surface triSurfaceMesh;
        file    "surface1.obj";
    }
    {
        name    fz2;
        type    faceZoneSet;
        action  new;
        source  searchableSurfaceToFaceZone;
        surface triSurfaceMesh;
        file    "surface2.obj";
    }
);

// ************************************************************************* //
